/*-----------------------------------------------------*/
/*              STM32系列开发板                */
/*-----------------------------------------------------*/
/*                     程序结构                        */
/*-----------------------------------------------------*/
/*USER     ：包含程序的main函数，是整个程序的入口      */
/*HARDWARE ：包含开发板各种功能外设的驱动程序          */
/*CORE     ：包含STM32的核心程序，官方提供，我们不修改 */
/*STLIB    ：官方提供的库文件，我们不修改              */
/*-----------------------------------------------------*/
/*                                                     */
/*           程序main函数，入口函数头文件              */
/*                                                     */
/*-----------------------------------------------------*/

#ifndef __MAIN_H
#define __MAIN_H

void TempHumi_State(void);  //函数声明，采集温湿度，并发布给服务器

void LED1_State(void);  //开电动窗帘
void Air_State(void);   //空调
void  meter_State(void);//电压
void  meter_State1(void);//电流
void  meter_State2(void);//总电量
void  meter_State3(void);//功率因素
void  meter_State4(void);//有功功率
void send_flage(void);




#endif











